---
kind: other
id: Methods.T:Autodesk.Revit.DB.Path3d
source: html/a27f994c-18fa-4816-efd5-ca5a98f323f3.htm
---
# Path3d Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.